### pandas - dataframe
- 2차원 행렬(표), Series를 묶어낸 자료형

In [3]:
import numpy as np
import pandas as pd

SyntaxError: invalid syntax (724184128.py, line 2)

---
### dataframe 생성

In [4]:
# dictionary - list 활용
data = {
    'one': [1, 2, 3, 4, 5],
    'two': ['가', '나', '다', '라', '마'],
    'three': [1.23, 2.34, 3.45, 4.56, 5.67],
    'four': True
}

df = pd.DataFrame(data)
print(df)

   one two  three  four
0    1   가   1.23  True
1    2   나   2.34  True
2    3   다   3.45  True
3    4   라   4.56  True
4    5   마   5.67  True

In [5]:
# list - dictionary 활용
data = [
    {'a': 1, 'b': 2, 'c': 3},
    {'a': 4, 'b': 5, 'c': 6},
    {'a': 7, 'b': 8, 'c': 9}
]

df = pd.DataFrame(data)

df.index = ['다람쥐', '고릴라', '원숭이']
print(df.index)

df.columns = ['협동심', '성실도', '인내심']
print(df.columns)

print(df)

Index(['다람쥐', '고릴라', '원숭이'], dtype='object')
Index(['협동심', '성실도', '인내심'], dtype='object')
     협동심  성실도  인내심
다람쥐    1    2    3
고릴라    4    5    6
원숭이    7    8    9

In [6]:
# 2차원 ndarray 활용
arr = np.random.randn(2, 3)
df = pd.DataFrame(arr, index=['ㄱ', 'ㄴ'], columns = ['A', 'B', 'C'])

# df.index = ['ㄱ', 'ㄴ']
# df.columns = ['A', 'B', 'C']

print(df)

          A         B         C
ㄱ  0.875324 -0.040832  0.642462
ㄴ  1.126766 -0.174822 -0.476682

In [7]:
data = {
    '이름': ['다람쥐', '판다', '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['M', 'F', 'F']
}

df = pd.DataFrame(data)
# df = pd.DataFrame(data, index=['squirrel', 'panda', 'koala'])

print(df)

    이름  위치 성별
0  다람쥐  독산  M
1   판다  종로  F
2  코알라  하남  F

In [8]:
# 행과 열을 바꿈
print(df.T)

      0   1    2
이름  다람쥐  판다  코알라
위치   독산  종로   하남
성별    M   F    F

---
### DataFrame 속성

In [9]:
print(df.index)
print(df.columns)
print(df.values, type(df.values))

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '위치', '성별'], dtype='object')
[['다람쥐' '독산' 'M']
 ['판다' '종로' 'F']
 ['코알라' '하남' 'F']] <class 'numpy.ndarray'>

In [10]:
print(df.shape)   # 형태
print(df.size)    # 요소 개수
print(df.ndim)    # 깊이
print(df.dtypes)  # 요소의 자료형

(3, 3)
9
2
이름    object
위치    object
성별    object
dtype: object

---
### DataFrame 메서드

In [11]:
bank_client_df = pd.DataFrame({
    'Client ID': [1, 2, 3, 4],
    'Client Name': ['Aly', 'Steve', 'Nicole', 'Morris'],
    'Net worth [$]': [35000, 3000, 100000, 2000],
    'Years with bank': [4, 7, 10, 15]
})

print(bank_client_df.head(2))
print(bank_client_df.tail(2))

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [12]:
print(bank_client_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Client ID        4 non-null      int64
 1   Client Name      4 non-null      object
 2   Net worth [$]    4 non-null      int64
 3   Years with bank  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes
None

In [13]:
print(bank_client_df.describe())

       Client ID  Net worth [$]  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000

In [15]:
# indexing / slicing
# iloc 인덱스 : 행/열 순서로 조회
# loc 라벨 : 행/열 순서로 조회 
print(bank_client_df.iloc[0])
print(bank_client_df.iloc[0].index)
print(bank_client_df.iloc[0].name)

Client ID              1
Client Name          Aly
Net worth [$]      35000
Years with bank        4
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

In [18]:
print(bank_client_df.iloc[:2], type(bank_client_df.iloc[2]))

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7 <class 'pandas.core.series.Series'>

In [19]:
# fancy indexing
print(bank_client_df.iloc[[0, 2]])
print(type(bank_client_df.iloc[[0, 2]]))

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
2          3      Nicole         100000               10
<class 'pandas.core.frame.DataFrame'>

In [22]:
# fancy indexing을 통한 조회는 결과가 1개여도 DataFrame 타입으로 변환.
# -> series를 반환한다는 것은 차원을 축소(제거)하는 것
# -> DataFrame을 반환한다는 것은 차원을 유지하는 것
print(bank_client_df.iloc[[2]].shape)
print(bank_client_df.iloc[2].shape)

bank_client_df.iloc[[2]], type(bank_client_df.iloc[[2]])

(1, 4)
(4,)

(   Client ID Client Name  Net worth [$]  Years with bank
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [23]:
# 2차원 indexing / slicing
bank_client_df.iloc[0, 1]

'Aly'

In [25]:
bank_client_df.iloc[:2, 1], type(bank_client_df.iloc[:2, 1])

(0      Aly
 1    Steve
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [26]:
bank_client_df.iloc[:2, 2:], type(bank_client_df.iloc[:2, 2:])

(   Net worth [$]  Years with bank
 0          35000                4
 1           3000                7,
 pandas.core.frame.DataFrame)

In [28]:
bank_client_df.index = ['client1', 'client2', 'client3', 'client4']
bank_client_df.iloc[2]

Client ID               3
Client Name        Nicole
Net worth [$]      100000
Years with bank        10
Name: client3, dtype: object

In [32]:
bank_client_df.loc['client2':'client4':2, ['Client Name','Years with bank']]

        Client Name  Years with bank
client2       Steve                7
client4      Morris               15

In [45]:
# 이름이 steve 인 고객 정보 출력
print(bank_client_df.loc[bank_client_df['Client Name'] == 'steve'])

# Client Name 만 출력
print(bank_client_df['Client Name'])

# Client Name과 Net worth[$] 출력
print(bank_client_df[['Client Name', 'Net worth [$]']])

Empty DataFrame
Columns: [Client ID, Client Name, Net worth [$], Years with bank]
Index: []
client1       Aly
client2     Steve
client3    Nicole
client4    Morris
Name: Client Name, dtype: object
        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [40]:
# filter
bank_client_df.filter(items=['Client Name', 'Net worth [$]'])

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [44]:
bank_client_df.filter(like='4', axis=0)

         Client ID Client Name  Net worth [$]  Years with bank
client4          4      Morris           2000               15

연습 문제

In [4]:
# 문제 1. ID가 3인 고객 조회
# 문제 2. 순자산(예치 금액)이 5,000달러가 넘는 고객 조회
# 문제 3. 거래 기간이 5년 이상인 고객 조회
# 문제 4. 이름이 S로 시작하는 고객 조회
# 문제 5. 거래 기간이 5년 이상이면서 이름이 S로 시작하는 고객 조회 (참고: and(&), or(|), not(~))

---
### 행 추가 및 삭제

In [63]:
students = [
    {'name': '호랑이', 'midterm': 95, 'final': 85},
    {'name': '늑대', 'midterm': 93, 'final': 90},
    {'name': '양', 'midterm': 100, 'final': 10}
]
df = pd.DataFrame(students)
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10

In [64]:
# 1. loc 이용 : 행 추가
df.loc[len(df)] = ['부엉이', 88, 72]
print(df)

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3  부엉이       88     72

In [65]:
# 2. pd.concat() 이용 : dataframe 병합
add_student_df = pd.DataFrame([['곰', 99, 24]], columns=['name', 'midterm', 'final'])
df = pd.concat([df, add_student_df], ignore_index=True) # ignore_index : 인덱스를 새로 부여

print(df)

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3  부엉이       88     72
4    곰       99     24

In [66]:
# 행 삭제
# index 이용
# df = df.drop(df.index[[0]])
df.drop(df.index[[0]], inplace=True)
print(df)

  name  midterm  final
1   늑대       93     90
2    양      100     10
3  부엉이       88     72
4    곰       99     24

---
### 컬럼 추가

In [71]:
df = pd.DataFrame({
    '이름': ['다람쥐', '판다', '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['M', 'F', 'F'],
    '키': [179, 165, 157],
    '체중': [50.1, 48.2, 51.3]
})

In [72]:
# 컬럼명 이용
df['취미'] = '인공지능 공부'
print(df)

    이름  위치 성별    키    체중       취미
0  다람쥐  독산  M  179  50.1  인공지능 공부
1   판다  종로  F  165  48.2  인공지능 공부
2  코알라  하남  F  157  51.3  인공지능 공부

In [73]:
# np.where(조건, True일때 값, False일 때 값) -> ndarray
df['성별(한글)'] = np.where(df['성별'] == 'M', '남성', '여성')
print(df)

    이름  위치 성별    키    체중       취미 성별(한글)
0  다람쥐  독산  M  179  50.1  인공지능 공부     남성
1   판다  종로  F  165  48.2  인공지능 공부     여성
2  코알라  하남  F  157  51.3  인공지능 공부     여성

In [75]:
# 기존 컬럼 연산
df['BMI'] = df['체중'] / ((df['키'] * 0.01) ** 2) # BMI = kg / m^2
print(df)

    이름  위치 성별    키    체중       취미 성별(한글)        BMI
0  다람쥐  독산  M  179  50.1  인공지능 공부     남성  15.636216
1   판다  종로  F  165  48.2  인공지능 공부     여성  17.704316
2  코알라  하남  F  157  51.3  인공지능 공부     여성  20.812203

In [76]:
# apply()
def get_type(value):
    return '저체중' if value < 18 else '표준'

df['BMI type'] = df['BMI'].apply(get_type)
print(df)

    이름  위치 성별    키    체중       취미 성별(한글)        BMI BMI type
0  다람쥐  독산  M  179  50.1  인공지능 공부     남성  15.636216      저체중
1   판다  종로  F  165  48.2  인공지능 공부     여성  17.704316      저체중
2  코알라  하남  F  157  51.3  인공지능 공부     여성  20.812203       표준

In [78]:
# 컬럼 삭제
df.drop('BMI type', axis=1, inplace=True)
print(df)

    이름  위치 성별    키    체중       취미 성별(한글)        BMI
0  다람쥐  독산  M  179  50.1  인공지능 공부     남성  15.636216
1   판다  종로  F  165  48.2  인공지능 공부     여성  17.704316
2  코알라  하남  F  157  51.3  인공지능 공부     여성  20.812203

---
### 정렬

In [79]:
df = pd.read_csv('data/bank_client_information.csv')
print(df)

  First Name Last Name                    Email Postal Code  Net Worth  \
0      Bird      Steve           bird@gmail.com     N94 3M0    5000.00
1       Noah     Small       nsmall@hotmail.com     N8S 14K   10000.00
2       Nina    Keller          azikez@gahew.mr     S1T 4E6    9072.02
3    Chanel      Steve         chanel@gmail.com     N7T 3E6   11072.02
4       Kate      Noor         kate@hotmail.com     K8N 5H6    5000.00
5      Samer        Mo          samer@gmail.com     J7H 3HY  100000.00
6       Heba    Ismail  heba.ismail@hotmail.com     K8Y 3M8   50000.00
7      Laila     Ahmed      Laila.a@hotmail.com     J8Y 3M0   20000.00
8     Joseph    Patton           daafeja@boh.jm     M6U 5U7    2629.13
9       Noah     Moran        guutodi@bigwoc.kw     K2D 4M9    8626.96

   Years with Bank
0                5
1                6
2                7
3               10
4               22
5               26
6               11
7                3
8                1
9               13

In [81]:
df.sort_values('Net Worth', ascending=False) # ascending 내림차순 정렬

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [83]:
# 오래된 고객순으로 출력
df.sort_values('Years with Bank', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [90]:
# 순자산이 많고 오래된 고객순으로 출력
df.sort_values(['Net Worth', 'Years with Bank'], ascending=[False, False])

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [92]:
# rank(): 순위
df['Rank'] = df['Net Worth'].rank(ascending=False).astype(int)
print(df.sort_values('Rank'))

  First Name Last Name                    Email Postal Code  Net Worth  \
5      Samer        Mo          samer@gmail.com     J7H 3HY  100000.00
6       Heba    Ismail  heba.ismail@hotmail.com     K8Y 3M8   50000.00
7      Laila     Ahmed      Laila.a@hotmail.com     J8Y 3M0   20000.00
3    Chanel      Steve         chanel@gmail.com     N7T 3E6   11072.02
1       Noah     Small       nsmall@hotmail.com     N8S 14K   10000.00
2       Nina    Keller          azikez@gahew.mr     S1T 4E6    9072.02
9       Noah     Moran        guutodi@bigwoc.kw     K2D 4M9    8626.96
0      Bird      Steve           bird@gmail.com     N94 3M0    5000.00
4       Kate      Noor         kate@hotmail.com     K8N 5H6    5000.00
8     Joseph    Patton           daafeja@boh.jm     M6U 5U7    2629.13

   Years with Bank  Rank
5               26     1
6               11     2
7                3     3
3               10     4
1                6     5
2                7     6
9               13     7
0                5     8
4               22     8
8                1    10